Revit 2027 API
Location.Move Method
Move the element within the project by a specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Move(
	XYZ translation
)
Public Function Move (
	translation As XYZ
) As Boolean
public:
bool Move(
	XYZ^ translation
)
member Move :
        translation : XYZ -> bool
Parameters
translation XYZ
The vector by which the element is to be moved.
Return Value
Boolean
If the element is moved successfully then the method return True, otherwise False.
Remarks
The move method is used to move an element within the project. Other elements may also be moved when this element is moved, for example: if the element is wall and it contains windows, the windows will also be moved.
Example
bool MoveUsingLocationCurve(Autodesk.Revit.ApplicationServices.Application application, Wall wall)
{
    LocationCurve wallLine = wall.Location as LocationCurve;
    XYZ translationVec = new XYZ(10, 20, 0);
    return (wallLine.Move(translationVec));
}
See Also
Reference
Location Class
Autodesk.Revit.DB Namespace